{
    "Unable to make request to Account Kit.": "Không thể thực hiện yêu cầu tới Account Kit.",
    "You are not authenticated to perform this request.": "Bạn không được xác thực để thực hiện yêu cầu này.",
    "Unable to process token response. The authentication process failed.": "Không thể xử lý mã xác thực. Quá trình xác thực thất bại.",
    "The provided client ID is invalid.": "Client ID không hợp lệ.",
    "The provided client is invalid or revoked.": "Thông tin client không hợp lệ hoặc client đã bị vô hiệu hóa.",
    "Cannot find authentication handler for [:provider] provider.": "Không thể xác thực tài khoản sử dụng [:provider].",
    "Cannot verify the integrity of the access token for [:provider] provider.": "Không thể xác minh tính toàn vẹn của access token được cung cấp bởi [:provider].",
    "Unable to find user from the access token. Possibly invalid token provided or invalid provider credentials.": "Không thể xác định người dùng từ access token. Access token hoặc thông tin client không hợp lệ.",
    "Error happened when fetching user from social provider.": "Lỗi xảy ra khi tìm người dùng từ thông tin tài khoản mạng xã hội.",
    "Unable to find the system user from the given access token provided by [:provider] provider.": "Không thể tìm tài khoản người dùng hệ thống từ access token cung cấp bởi [:provider].",
    "The user account has not been confirmed yet.": "Tài khoản người dùng chưa được xác nhận.",
    "This [:provider] account has been attached to trashed user in the system.": "Tài khoản [:provider] đã được gán với người dùng bị xóa trong hệ thống.",
    "Cannot connect currently authenticated user with user from [:provider] provider. Possibly different [:provider] account is using.": "Không thể kết nối tài khoản người dùng hiện tại với tài khoản [:provider]. Một tài khoản [:provider] khác có thể đang được sủ dụng.",
    "Unable to access the e-mail address associated with your [:provider] account.": "Không thể truy cập địa chỉ e-mail được liên kết với tài khoản [:provider].",
    "Unable to obtain authentication information of [:provider] provider. The authentication process failed.": "Không thể truy cập thông tin xác thực từ [:provider]. Quá trình xác thực lỗi.",
    "The provided Account Kit ID is invalid.": "Account Kit ID không hợp lệ.",
    "Cannot find the phone or email address associated with the Account Kit User.": "Không thể tìm số điện thoại hoặc địa chỉ e-mail từ tài khoản Account Kit.",
    "The phone number or email has already been linked to an existing user account.": "Số điện thoại hoặc địa chỉ e-mail đã được sử dụng cho một tài khoản khác trong hệ thống.",
    "Cannot find user associated with the given access token provided by the social provider.": "Không thể tìm thấy tài khoản người dùng từ access token cung cấp bởi nhà cung cấp tài khoản mạng xã hội.",
    "Check the correctness of the access token provided by the [:provider] provider.": "Access token cung cấp bởi [:provider] không hợp lệ.",
    "The callback URL contains invalid or missing required parameters.": "Đường dẫn callback bị thiếu hoặc chứa các tham số không chính xác.",
    "The given price history attribute - [:attribute] does not exist.": "Không tìm thấy thuộc tính [:attribute] trong lịch sử giá.",
    "You are not allowed to perform this request.": "Bạn không được phép thực hiện yêu cầu này.",
    "We are unable to authorize your request.": "Yêu cầu của bạn chưa được xác thực.",
    "Cannot find the given :entity.": "Không thể tìm thấy :entity được chỉ định.",
    "Duplicated members are not allowed.": "Thành viên trùng lặp là không được phép.",
    "The ID field is required.": "Trường ID là bắt buộc.",
    "Unauthorized.": "Không xác thực.",
    "The client information or the refresh token you provided is invalid.": "Thông tin client hoặc refresh token không hợp lệ.",
    "Unable to issue access token.": "Không thể tạo access token.",
    "Access token has ben revoked.": "Access token đã được vô hiệu hóa.",
    "Cannot revoke the token.": "Không thể vô hiệu hóa access token được chỉ định.",
    "We have e-mailed your account confirmation link.": "Chúng tôi đã gửi e-mail kèm đường dẫn liên kết xác nhận tài khoản của bạn.",
    "An email has been sent to your e-mail address.": "Một e-mail đã được gửi đến địa chỉ e-mail của bạn.",
    "Your password has been reset.": "Mật khẩu của bạn đã được khôi phục.",
    "Cannot reset your password.": "Không thể khôi phục mật khẩu của bạn",
    "Cannot link social account to user on system.": "Không thể liên kết tài khoản mạng xã hội tới tài khoản trên hệ thống.",
    "The default bank has been updated.": "Tài khoản ngân hàng mặc định đã được cập nhật.",
    "Make sure your account is activated.": "Đảm bảo rằng tài khoản của bạn đã được kích hoạt.",
    "Invalid display type provided.": "Loại hiển thị không hợp lệ được cung cấp.",
    "This page is currently inactive.": "Trang hiện tại không tồn tại.",
    "Your password has been set already. Please reset your password in case you forgot.": "Mật khẩu đã được đặt trước đó. Vui lòng khôi phục mật khấu nếu quên.",
    "User password has been created.": "Mật khẩu người dùng đã được tạo.",
    "User password has been updated.": "Mật khẩu người dùng đã được cập nhật.",
    "Phone number has been verified already.": "Số điện thoại của bạn đã được xác thực trước đó.",
    "Phone number has been verified.": "Số điện thoại đã được xác thực.",
    "Verification email has been sent.": "Mail xác thực đã được gửi.",
    "The user credentials were incorrect.": "Thông tin đăng nhập của người dùng không chính xác.",
    "Wrong old password": "Mật khẩu cũ sai",
    "Invalid hash.": "Chuỗi bảo mật không hợp lệ.",
    "Change password successfully": "Thay đổi mật khẩu thành công",
    "Your email was already an member of this enterprise": "Email của bạn đã là thành viên của doanh nghiệp này",
    "Account has been updated.": "Tài khoản đã được cập nhật.",
    "This action is unauthorized." : "Ban không đủ quyền truy cập."
}
